#include <iostream>
using namespace std;

int main()
{
	double x, y;
	bool res = false;

	cout << "Enter the coordinates of the point (x, y): ";
	cin >> x >> y;

	//Стойността на правата минаваща през (-2, 4) и (1, 3) в точката x
	double l1 = (-1 / 3.0) * x + (10 / 3.0);
	//Стойността на правата минаваща през (1, 3) и (3, 5) в точката x
	double l2 = x + 2;
	//Стойността на правата минаваща през (-2, 4) и (3, 5) в точката x
	double l3 = (1 / 5.0) * x + (22 / 5.0);

	//Ако x се намира в частта на триъгълника с горна граница l3 и долна l1
	//и е се наира между двете прави l1 и l3
	if (x >= -2 && x <= 1 && y>= l1 && y<= l3) {
		res = true;
	}
	//Ако x се намира в частта на триъгълника с горна граница l3 и долна l1
	//и е се наира между двете прави l2 и l3
	else if (x >= 1 && x <= 3 && y >= l2 && y <= l3) {
		res = true;
	}

	cout << "The point (" << x << ", " << y << ") is" << (res ? " " : "n't ") << "in the triangle!";
}
