/*
    Задача 2

	Да се напише функция, която по подаден символен низ низ, 
	да върне срещанията на всяка буква в подаден целочислен масив 
	от 26 елемента(няма разлика между малки и големи букви).
*/

#include <iostream>
#include <string>

using namespace std;

const int N = 26;


/*
* Функция, която по подаден символ проверява дали той е латинска буква
*/
bool isAlpha(char ch) {
	return (ch >= 'a' && ch <= 'z' || ch >= 'A' && ch <= 'Z' ? true : false);
}

/*
* Функция, която проверява дали един символ е главна буква
*
* @param[in] ch подадения символ за проверка
*
* @returns true - ако символа е главна буква
*          false - ако символа не е главна буква
*/
bool isUpper(char ch) {
	if (ch >= 'A' && ch <= 'Z') return true;
	return false;
}
void toLower(string& str, int index) {

	//Със length() взимаме размера на символния низ върху, който 
	//сме приложили функцията
	//В случая ако символния низ има дължина 0 той е празен
	if (!str.length()) {
		cout << "Null string..";
		return;
	}


	//Ако индекса не е в границите на символния низ прекратяваме изпълнението
	if (!(index >= 0 && index <= str.length())) {
		cout << "Index out of range..";
		return;
	}

	//Тук логиката е еквивалентна, само че понеже имаме главна буква вадим 'А',
	//за да намерим отново релативната позиция на буквата спрямо главните и след
	//това добавяме това отместване съм малко 'а', за да получим еквивалентната малка буква
	if (isUpper(str[index])) {
		str[index] = str[index] + 'a' - 'A';
	}
}


/*
*   Функция, която по подаден символен низ и масив,
*   преброява колко пъти се среща всяка буква (няма разлика 
*   между малки и главни букви). На всеки елемент от масива
*   съответства буква от латиницата.
* 
*   count[0] - 'a'/'A'
*   count[1] - 'b'/'B'
*      * 
*      *
*   count[25] - 'z'/'Z'
* 
*/
void countLetters(string str, int count[]) {
	
	//Зануляваме си елементите на масива
	for (int i = 0; i < N; i++) {
		count[i] = 0;
	}

	//Обхождаме поелементно символния низ
	for (int i = 0; i < str.length(); i++) {
		
		//Ако е текущия символ е буква
		if (isAlpha(str[i])) {
			toLower(str, i); //Правим буквата с малка

			count[str[i] - 'a']++; //Увеличаваме с едно брояча на елемента съответстваш на определената буква
		}
	}
}


int main() {
	string str = "Lorem ipsum dolor sit amet...";
	int arr[N];

	countLetters(str, arr);

	//Принтираме колко всяка буква се среща в символния низ
	for (int i = 0; i < N; i++) {
		cout << (char)('a' + i) << " " << arr[i] << endl;
	}
}