	int n;
	cin >> n;
	int fakeN = n;
	//Създаваме си си копие на числото, което ще раздробяваме, тъй като накрая ще ни трябва оригиналното

	int newN = 0;
	//Тук ще "трупаме" числото, след като го раздробяваме във fakeN
	
	//Идеята на цикъла е да запишем числото наобратно и накрая да го сравним с въведеното от нас
	while (fakeN != 0)
	{
		newN *= 10;
		//Върнете се на долния ред след като прочетете следващите два. 
		//Тук новополученото ни число го умножаваме по 10, за да можем да запишем следващата цифра от n на следваща позиция в newN
		//Ако е примерно 14, умножаваме по 10->140 и като добавим слеващата последна цифра от n (да кажем 7) става 147
		
		newN += fakeN % 10;
		//Взимаме последната цифра на нашето число(n) и я записваме на първо място в newN.
		
		fakeN /= 10;
		//После се отърваваме от последната цифра на n, за да продължим проверката и така докато не стане 0.
	}
	cout << (n == newN);// Това е друг начин да напишем if(n==newN) cout<<1; else cout 0;
