int number;
	cin >> number;
	int pow = 1;
	int n; //Това ни е бройната система (от 2 до 10)
	cin >> n;
	while (number > 0 || pow>1)
	{
	
		while (pow <= number && pow>0) //Тук проверяваме най-високата степен на броичната ни система(n), която се съдържа в number
		{
			pow *= n;
		}
		pow /= n; 
		//Трябва да разделим на n, иначе нашето число, ще е по-малко от n на степента
		//Ако сме в ситуацията, в която  pow e по-голямо от нашето число (number), то няма да влезем в нито един от долните if-oве или цикъла и ще отпечата 0 на екрана,
		//което е точно това, което искаме, защото така илиза, че тази степен на бройната ни система не се съдържа в числото ни, което не бива да го забравяме и
		//трябва да бъде отразено

		int powcopy = pow; 
		//Ще манипулираме pow, но стойността му ще ни трябва, затова трябва да го помним

		int count = 2;
		while (pow <= number && pow > 0) //Тук проверяваме колко пъти (от 0 до n-1) най-високата степен на бройната система се съдържа в нашето число 
		{
			pow = powcopy;
			pow *= count;
			count++;
		}
		if (count > 2)
			pow = powcopy* (count - 2);

		if (pow <= number && pow > 0)
		{
			cout << count - 2;
			//Просто изкарваме колко пъти се съдържа в нашето число (number)
			
			number -= pow;
			//Разбира се понижаваме числото ни с толкова
			
			pow = powcopy;
			//Това го правим, тъй като ни интересува вече колко пъти по-ниската степен се съдържа с каквото е останало от числото ни
		}
		else cout << 0;
	}
