#include <iostream>
using namespace std;


/**
	Рекурсивното сумиране на числата извършваме по сления начин.
	За да намерим сумата от първия до последни елемент ние връщаме
	сумата на първия елемент със сумата на следващия до последния.
	
	recSum : {5.5, -6.4, 2.1, 3.8, 1, 1.1} -> 5.5 + recSum {-6.4, 2.1, 3.8, 1, 1.1}
	recSum : {-6.4, 2.1, 3.8, 1, 1.1} -> -6.5 + recSum{2.1, 3.8, 1, 1.1}

	и така до 

	recSum: {1.1} -> 1.1

	Забележете, че подаваме не следващия елемент а указателя към него
	и текущия брой елементи без 1. Така в случая на всяка следваща 
	итерация подаваме подмасива след текущия елемент с един елемент
	по-малко. 
*/
double recSumArr(double arr[], int size) {
	if (size == 1) {
		return arr[0];
	}

	return arr[0] + recSumArr(arr + 1, size - 1);
}

int main() {
	double arr[] = { 5.5, -6.4, 2.1, 3.8, 1, 1.1 };


	cout << recSumArr(arr, 6);
}