//Тъй като коментирахме два случая, просто да изведете транспонираната матрица или да я транспонирате и да я изведете

//1.Само извеждане 

	for (int j = 0; j < N; j++)//Просто извеждаме първо колоните (от горе наодлу)
		for (int i = 0; i <N; i++)
			cout << arr[i][j] << " ";
      
      
 //2.Транспониране
 
 //Обхождаме всички елементи под главния диагонал и ги разменяме със съответните им над него 
 //Ако обходим висчки елементи, ще направим размяната два пъти и все едно нищо не сме променили.
 for (int i = 0; i < N; i++)
		for (int j = 0; j < i; j++)
		{
			int temp = arr[j][i];
			arr[j][i] = arr[i][j];
			arr[i][j] = temp;
		}

 //След това извеждаме стандартно
	for (int i = 0; i < N; i++)
		for (int j = 0; j < N; j++)
			cout << arr[i][j] << " ";
