/**
	Задание:
	
	Официално ще ставате приложни математици, така че е време някой друг да почне да смята вместо вас. 
	Напишете програма, която по подадени височина и дължина на правоъгълник да пресмята периметъра и 
	лицето му. Изхода да се отпечата четливо, а не нахвърляни числа по конзолата :).
*/

#include <iostream>
using namespace std;

int main() {
	/**
		Основното при създаване на една програма е:
		* Да си прочетете хубаво условите. Допускат се доста грешки като почнете вие да си доизмисляте задачата или 
		  не четете хубаво условието. Основното, което трябва да изведете от задачата е какво получавате като вход и
		  какво се изисква като изход.
		* Да обмислите алгоритъм, който да реализирате, така че да решите задачата. Хубаво е първо да го разиграете на
		  хартия преди да почнете да пишете код, защото в повечето случаи мислите едно то се случва друго, почвате да 
		  променяте навсякъде някакви неща, за да до нагласите нещата. Други неща почват да се чупят и работата 
		  става грозна, а вие само си губите времето да оправяте грешна логика. Така че е по-добре да си планирате нещата
		  хубаво и след това набързо да си напишете програмата, а не директно да пишете и после да си губите времето.
	*/

	/**
		В случая от нас се изисква по подадени височина и дължина да сметнем лице на правоъгълник. Страните на правоъгълник
		могат да бъдат реални числа, както и лицето, могат да бъдат реални числа, а не само целочислени, така че си дефинираме
		три променливи: две от входа и една за изход (може и директно да изпишем резултата на екрана, но ако ни беше нужна сметката
		след това после пак трябваше да караме компютъра да смята)
	*/

	double height, width, area;

	//Стандартно си въвеждаме нещата
	cout << "Enter height: "; 
	cin >> height;

	cout << "Enter width: ";
	cin >> width;

	/**
		Пресмятаме лицето по познатата формула и тогава го записваме в променливата area. Обърнете внимание, че първо се изпълнява 
		израза от дясната страна на оператора и след това се присвоят на левия операнд. Това важи и ако имате навързани няколко 
		израза с оператори =

		y = 5 + (x = 2) //Има и такива идиотщини :D. В случая първо x  става 2 и после y = 5 + x, което е 7
	*/
	area = height * width; 

	cout << "Area of rectangle = " << area;
}