/**
	По въведени координатите на две точки от декартовата равнината да се намери разстоянието (d) между тях 
	и да се изпише на екрана подходящо. Първо се въвеждат координатите на първата точка, а после на втората. 
	Резултата да се закръгли до втория символ след запетаята.
*/

#include <iostream>
#include <cmath>

using namespace std;

int main() {
	/**
		Това е от типовете задачи, които ви се казва какво ви дават и какво искат, но не казват 
		как да го получите. В случая задачата се решава геометрически. Ако си начертае двете точки
		на една декартова двуизмерна мрежа и за всяка точка спуснете перпендикуляри към координатните оси
		получавате правоъгълен триъгълник. Имате двата катета на триъгълника - те са модула от разликата на
		съответните координати, защото не се знае коя координата на коя точка е по-голямата. А търсеното е 
		от условието е хипотенузата на същия триъгълник. От тук с познатия на вас Питагор правите сметките
	*/

	double x1, y1, x2, y2;

	cout << "Enter x1 = ";
	cin >> x1;
	cout << "Enter y1 = ";
	cin >> y1;
	cout << "Enter x2 = ";
	cin >> x2;
	cout << "Enter y2 = ";
	cin >> y2;

	double dist = sqrt(pow(abs(x1 - x2), 2) + pow(abs(y1 - y2), 2));

	dist = ((int)(dist * 100 + 0.5)) / 100.0;

	cout << "Dist = " << dist << endl;
}