int arr[N];

	for (int i = 0; i < N; i++)
		cin >> arr[i];

//Използваме метода на мехручето

	for (int i = 0; i < N - 1; i++)//В края на всяка иетрация на външния цикъл изплува съответният най-голям елемент в края на масива на съответната позиция
  //тоест при итерацията i=1, изплува в края на масива най-големият елемент, при i=2изплува на n-2 място торият най-голям елемент и т.н
	{
		for (int j = 0; j < N - i - 1; j++)//Сравняваме всеки два съседни елементи и, ако първият е по-голям от втория, ги разменяме
		{
    //Условието за j изглежда така, тъй като няма смисъл да сравняваме предпоследния елемент с последния, тъй като за него вече знаем, че е най-големият
    //(Ако i=2, това значи, че вече най-големият елемент сме го сложили в края на масива при итерацията i=1 и няма смисъл да сравняваме последните два)
    
			if (arr[j + 1] < arr[j])
			{//temp ни служи да "помним" стойността на arr[j]
				int temp = arr[j];
				arr[j] = arr[j + 1];
				arr[j + 1] = temp;
			}
		}
	}
	for (int i = 0; i < N; i++)
		cout << arr[i] << " ";

