for (int i = 0; i < N; i++)
	   cin >> arr[i];

   for (int i = 0; i < N; i++)
   {
	   int current = arr[i] + i;
	   for (int j = 0; j < N; j++) //Обръщайте внимание как кръщавате ппроменливата, с която обхождате, тъй като i вече го ползваме и може да стане мазало
	   {
		   if (current == arr[j])// Ако current (текущото ни число от главния цикъл + i) е равно на кое да е число от целия масив
		   {
			   cout << arr[i] << " ";
			   break; // С това спираме обхождането на вътршния цикъл, тъй като, ако сме намерили число, изпълняващо условието, не ни интересува
         //дали има още такива или е само едно. Но с break прекъсваме САМО вътрешния цикъл и си преминаваме към следващата стъпка в главния
		   }
	   }
   }
