int arr[N];

int k; cin >> k;
int copy = N;//ТЪй като ще работим с числото N, ни трябва копие

for (int i = 0; i < N; i++)
	cin >> arr[i];

for (int i = 0; i < copy; i++)
{
	if (arr[i] < k)
	{
		for (int j = i; j < copy - 1; j++)
    //Искаме да премахнем елемента arr[i], което може да стане като го приравним не елемента след него
    //Елемента след него го приравняваме на този след него и т.н., затова и условито е j<copy-1, тъй като иначе ще разглеждаме елемент извън масива
		{
			arr[j] = arr[j + 1];
		}
		copy--;вече не ни интересува посления елемент на масива, тъй като сме приравнили предпоследния на него и би се получило дублиране
		i--;//намаляме i, тъй като може да се окаже, че елементът след arr[i] също е по-малък от k, и така като влезем в следващата итерация, бихме го изпуснали
	}
}


for (int i = 0; i < copy; i++)
	cout << arr[i] << " ";
