/*
Да се намери минималният елемент и да се отпечата сумата на
тези след него
Вход: -3 5 6 110 -9 12 1
Изход: 13
*/

double arr[N];
	for (int i = 0; i < N; i++)
		cin >> arr[i];

	double min = arr[0];
	int count = 0;

	for (int i = 1; i < N; i++) //Аналогично на предната задача, само че този път търсим само най-малкия елемент
	{
		if (arr[i] < min)
		{
			min = arr[i];
			count = i; //Запазваме И позицията, на която се намира най-малкия елемент, за да знаем откъде да тръгнем в цикъла, вкойто ще пресмятаме сумата
		}
	}


	double sum = 0;
	for (int i = count+1; i < N; i++) //Count+1, тъй като ни интересуват числата след позицията на минималния, без самия него
	{
		sum += arr[i];
	}

	cout << "Sum = " << sum;
