/*Дадени са елементите на главния диагонал на квадратна матрица с размер n (4<=n<=10) в масив със същата големина.
Да се напише програма, която по подаден този масив въвежда елементите в матрицата по нейния главен диагонал. 
Да се пресметнат елементите под главния диагонал, като всеки такъв елемент е равен на средното аритметично на елемента над 
него и елемента вдясно от него. За стойността на всеки елемент над главния диагонал се получава от сумата на индекса на текущата 
колона и стойността на елемента вляво от него.
*/
	int n;
	do
	{
		cin >> n;
	} while (n < 4 || n>10);
	double arr[N] = { 1,2,3,4,5 };
	double fill[N][N];

	for (int i = 0; i < n; i++)//запълваме главния диагонал
	{
		fill[i][i] = arr[i];
	}

	int copy;
	for (int i = 1; i < n; i++)//запълваме под главния диагонал
	{
		copy = i;
		for (int j = 0; j < n - i; j++)
		{
			fill[copy][j] = (fill[copy - 1][j] + fill[copy][j + 1])/2;
			copy++;
		}
	}

	for (int i = 0; i < n - 1; i++)//над главния диагонал
	{
		for (int j = i + 1; j < n; j++)
		{
			fill[i][j] = fill[i][j - 1] + j;
		}
	}
